Конфигурация/Reports/ТБС_КанбанДоска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Report>
		<Properties>
			<Name>ТБС_КанбанДоска</Name>
			<Comment>Канбан доска</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Конфигурация/Documents/ТБС_ЗаявкиIT.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ТБС_ЗаявкиIT</Name>
			<Comment>Заявки IT</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТБС_БаллыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТБС_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполненияЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дивизион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТБС_Дивизионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланироватьНаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТБС_ИсточникиЗаявокIT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассовыйИнцидент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Система</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТБС_СистемыIT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТБС_КатегорииIT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТБС_СтатусыЗаявкиIT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоемкостьРабЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВыполненияЗаявки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапланироватьНаДату</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Решение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрудоемкостьРабЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапРабот</Name>
							<Comment>Этап работ</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТБС_ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Reports/ТБС_КанбанДоска/Ext/ObjectModule.bsl
// Служебные процедуры и функции
#Область СлужебныеПроцедурыИФункции

Функция СформироватьОтчет() Экспорт
	
	Результат.Очистить();
	
	ТЗ = СформироватьШаблон();
	
	НомерСтроки = 2;
	
	Линия  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	мШрифт = Новый Шрифт(,,12,Ложь,Ложь , ,, );
	
	Для Каждого мСтрока Из ТЗ Цикл
		
		НомерСтроки = 2;
		РезультатЗапроса = СформироватьВыборкуПоЗаявкам(мСтрока.Статус);
		Если РезультатЗапроса.Пустой() Тогда
			ТекущаяОбласть = Результат.Область(НомерСтроки,мСтрока.Колонка);
			АвтоНастройкаОбласти(ТекущаяОбласть,Линия,мШрифт);
			ТекущаяОбласть.Параметр = Строка(мСтрока.Статус);
			НомерСтроки = НомерСтроки + 1;
		Иначе
			СформироватьРезультатЗапроса(РезультатЗапроса,мСтрока,НомерСтроки,Линия,мШрифт);	
		КонецЕсли; 
		
		
	КонецЦикла;

КонецФункции

Функция СформироватьШаблон()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТБС_СтатусыЗаявкиIT.Ссылка,
	|	ТБС_СтатусыЗаявкиIT.Порядок КАК Порядок
	|ИЗ
	|	Перечисление.ТБС_СтатусыЗаявкиIT КАК ТБС_СтатусыЗаявкиIT
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Статус");
	ТЗ.Колонки.Добавить("Колонка");
	
	Колонка = 2;
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока					= ТЗ.Добавить();
		НоваяСтрока.Статус			= Выборка.Ссылка;	
		НоваяСтрока.Колонка         = Колонка;

		Колонка = Колонка + 1;
		
	КонецЦикла; 
	
	Возврат ТЗ;
	
КонецФункции

Функция СформироватьВыборкуПоЗаявкам(Статус)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТБС_ЗаявкиIT.Статус,
	|	ТБС_ЗаявкиIT.Ссылка,
	|	ТБС_ЗаявкиIT.Пользователь,
	|	ТБС_ЗаявкиIT.Система,
	|	ТБС_ЗаявкиIT.Категория,
	|	ТБС_ЗаявкиIT.Исполнитель,
	|	ТБС_ЗаявкиIT.Важность,
	|	ТБС_ЗаявкиIT.Дата КАК Дата,
	|	ТБС_ЗаявкиIT.ВыполнитьДо,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ТБС_ЗаявкиIT КАК ТБС_ЗаявкиIT
	|ГДЕ
	|	ТБС_ЗаявкиIT.Статус = &Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Статус",     Статус);
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТБС_ЗаявкиIT.Статус = &Статус",
		" ТБС_ЗаявкиIT.Статус = &Статус И ТБС_ЗаявкиIT.Исполнитель = &Исполнитель");
	КонецЕсли; 
	РезультатЗапроса = Запрос.Выполнить();
	 
	Возврат РезультатЗапроса;
	
КонецФункции

Функция СформироватьРезультатЗапроса(РезультатЗапроса,мСтрока,НомерСтроки,Линия,мШрифт)
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекущаяОбласть = Результат.Область(НомерСтроки,мСтрока.Колонка);
		
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ОбщийИтог Тогда
			
			Текст = Строка(мСтрока.Статус) + " (" + Строка(Выборка.Количество) + ")";
			АвтоНастройкаОбласти(ТекущаяОбласть,Линия,мШрифт);
			
		Иначе
			Текст = Формат(Выборка.Дата,"ДФ=dd.MM.yyyy") + Символы.ПС
			+ "Важность:" + Строка(Выборка.Важность) + Символы.ПС
			+ "Система: " + Строка(Выборка.Система) + Символы.ПС
			+ "Категория: " + Строка(Выборка.Категория) + Символы.ПС
			+ "Исполнитель: " + Строка(Выборка.Исполнитель) + Символы.ПС
			+ "Выполнить до: " + Формат(Выборка.ВыполнитьДо,"ДФ=dd.MM.yyyy");
			
			АвтоНастройкаОбласти(ТекущаяОбласть,Линия,Неопределено);

		КонецЕсли; 
		
		ТекущаяОбласть.Параметр 		   = Текст;
		ТекущаяОбласть.Расшифровка         = Выборка.Ссылка;
		ТекущаяОбласть.ПараметрРасшифровки = Выборка.Ссылка;
		//ТекущаяОбласть.ПараметрКартинки    = БиблиотекаКартинок.ВажностьВысокая;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла; 
	
КонецФункции

Функция АвтоНастройкаОбласти(ТекущаяОбласть,Линия,мШрифт)
	
	ТекущаяОбласть.ШиринаКолонки	= 24;
	ТекущаяОбласть.РазмещениеТекста	= ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ТекущаяОбласть.ГраницаСверху	= Линия; 
	ТекущаяОбласть.ГраницаСнизу		= Линия; 
	ТекущаяОбласть.ГраницаСправа	= Линия; 
	ТекущаяОбласть.ГраницаСлева		= Линия; 
	ТекущаяОбласть.Шрифт			= мШрифт;
	Если мШрифт <> Неопределено Тогда
		ТекущаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;	
	Иначе
		ТекущаяОбласть.ЦветФона = WebЦвета.Лимонный;
	КонецЕсли; 
	
КонецФункции

#КонецОбласти
